backend/app/controllers/questionnaires_controller.rb

    def index
        questionnaires = Questionnaire.order(updated_at: :desc)
---
SELECT "questionnaires".* FROM "questionnaires" ORDER BY "questionnaires"."updated_at" DESC

    def show
        questionnaire = Questionnaire.find_by(id: params[:id])
---
SELECT "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        questionnaire = Questionnaire.new(questionnaire_params)

        question_params[:questions].each do |question|
            q = Question.new(content: question[:content])
            q.assign_attributes(question[:answers])
            q.questionnaire = questionnaire
            q.save
---
SELECT "questions".* FROM "questions" WHERE "questions"."questionnaire_id" = $1  [["questionnaire_id", 65]]
INSERT INTO "questionnaires" ("title", "created_at", "updated_at", "result", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["created_at", "2020-11-20 21:37:40.808513"], ["updated_at", "2020-11-20 21:37:40.808513"], ["result", ""], ["description", ""]]
INSERT INTO "questions" ("created_at", "updated_at", "questionnaire_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-11-20 21:37:40.829938"], ["updated_at", "2020-11-20 21:37:40.829938"], ["questionnaire_id", 67]]