backend/app/controllers/questions_controller.rb

    def index
        questions = Question.all
---
SELECT "questions".* FROM "questions"

    def show
        question = Question.find_by(id: params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]