backend/app/controllers/questionnaires_controller.rb

    def index
        questionnaires = Questionnaire.all
---
SELECT "questionnaires".* FROM "questionnaires"